In [24]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series([0, 10, 20], index=['a', 'b', 'c'])

In [4]:
ser * 2

a     0
b    20
c    40
dtype: int64

In [6]:
ser['b']

10

In [7]:
pd.Series({'a': 0, 'b': 10})

a     0
b    10
dtype: int64

In [9]:
ser.iloc[1]

10

In [10]:
alice = pd.Series({'Algebra': 5, 'Geometry': 3, 'Music': 4})
bob = pd.Series({'Algebra': 4, 'Music': 3, 'History': 4})

In [13]:
alice.dtype

dtype('int64')

In [14]:
grade = alice + bob

In [15]:
grade.dtype

dtype('float64')

In [16]:
grade

Algebra     9.0
Geometry    NaN
History     NaN
Music       7.0
dtype: float64

In [17]:
grade['Geometry']

nan

In [18]:
float("NaN")

nan

In [19]:
if grade['Geometry'] == float("NaN"):
    print("It's a NaN")
else:
    print("????!!!")

????!!!

In [20]:
if float("NaN") == float("NaN"):
    print("It's a NaN")
else:
    print("????!!!")

????!!!

In [22]:
if pd.isna(float("NaN")):
    print("Yes")

Yes

In [23]:
pd.isna(None)

True

In [25]:
np.isnan(float("NaN"))

True

In [26]:
np.isnan(None)

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

In [27]:
alice

Algebra     5
Geometry    3
Music       4
dtype: int64

In [28]:
alice['Algebra':'Geometry']

Algebra     5
Geometry    3
dtype: int64

In [30]:
alice[0:1 + 1]

Algebra     5
Geometry    3
dtype: int64

In [31]:
alice.values

array([5, 3, 4])

In [32]:
df = pd.DataFrame([['Alice', 1, 2, 3], ['Bob', 4, 5, 6], ['Claudia', 2, 3, 4]],
                  columns=['Name', 'Algebra', 'Geometry', 'Calculus']
                  )

In [34]:
df.dtypes

Name        object
Algebra      int64
Geometry     int64
Calculus     int64
dtype: object

In [36]:
x = np.array(['a', 'b'])

In [37]:
x[0] = 'hello, world'

In [38]:
x

array(['h', 'b'], dtype='<U1')

In [39]:
df

      Name  Algebra  Geometry  Calculus
0    Alice        1         2         3
1      Bob        4         5         6
2  Claudia        2         3         4

In [40]:
df.set_index('Name')

         Algebra  Geometry  Calculus
Name
Alice          1         2         3
Bob            4         5         6
Claudia        2         3         4

In [42]:
df.set_index('Name', inplace=True)

In [44]:
df.index

Index(['Alice', 'Bob', 'Claudia'], dtype='object', name='Name')

In [45]:
df.columns

Index(['Algebra', 'Geometry', 'Calculus'], dtype='object')

In [48]:
pd.DataFrame([[1, 20, 54], [13, 23, 54]])

    0   1   2
0   1  20  54
1  13  23  54

In [50]:
df['Alice']

KeyError: 'Alice'

In [53]:
df['Algebra']

Name
Alice      1
Bob        4
Claudia    2
Name: Algebra, dtype: int64

In [54]:
df[0:2]

       Algebra  Geometry  Calculus
Name
Alice        1         2         3
Bob          4         5         6

In [55]:
df.loc['Alice']

Algebra     1
Geometry    2
Calculus    3
Name: Alice, dtype: int64

In [56]:
df.loc['Alice', 'Geometry']

2

In [57]:
df.loc[:, 'Geometry']

Name
Alice      2
Bob        5
Claudia    3
Name: Geometry, dtype: int64

In [58]:
df.loc[:, 'Algebra':'Geometry']

         Algebra  Geometry
Name
Alice          1         2
Bob            4         5
Claudia        2         3

In [59]:
df.iloc[0]

Algebra     1
Geometry    2
Calculus    3
Name: Alice, dtype: int64

In [61]:
new_df = pd.DataFrame([[2, 3, 1], [5, 6, 7]], index=[1, 0])

In [63]:
new_df

   0  1  2
1  2  3  1
0  5  6  7

In [64]:
new_df.loc[0]

0    5
1    6
2    7
Name: 0, dtype: int64

In [65]:
new_df.iloc[0]

0    2
1    3
2    1
Name: 1, dtype: int64

In [68]:
df[:2]['Algebra']

Name
Alice    1
Bob      4
Name: Algebra, dtype: int64

In [70]:
df.loc['Alice', 'Algebra'] = 4

In [71]:
df

         Algebra  Geometry  Calculus
Name
Alice          4         2         3
Bob            4         5         6
Claudia        2         3         4

In [73]:
df[:2]['Algebra'][b'Alice'] = 2

/var/folders/h2/9nyrt4p55kq6pdvqg02_zmj40000gn/T/ipykernel_65511/2528179609.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[:2]['Algebra']['Alice'] = 2
/var/folders/h2/9nyrt4p55kq6pdvqg02_zmj40000gn/T/ipykernel_65511/2528179609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[:2]['Algebra']['Alice'] = 2

In [74]:
df

         Algebra  Geometry  Calculus
Name
Alice          2         2         3
Bob            4         5         6
Claudia        2         3         4

In [77]:
short_df_algebra = df[:2]['Algebra']

In [79]:
short_df_algebra['Alice'] = 3

/var/folders/h2/9nyrt4p55kq6pdvqg02_zmj40000gn/T/ipykernel_65511/3953284833.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  short_df_algebra['Alice'] = 3

In [80]:
short_df_algebra_copy = df[:2]['Algebra'].copy()

In [81]:
short_df_algebra_copy['Alice'] = 4

In [83]:
df.mean()

Algebra     3.000000
Geometry    3.333333
Calculus    4.333333
dtype: float64

In [84]:
df.mean(axis=1)

Name
Alice      2.666667
Bob        5.000000
Claudia    3.000000
dtype: float64

In [86]:
df['mean'] = df.mean(axis=1)

In [97]:
df.assign(min=df.min(axis=1))

         Algebra  Geometry  Calculus      mean  min
Name
Alice          3         2         3  2.666667  2.0
Bob            4         5         6  5.000000  4.0
Claudia        2         3         4  3.000000  2.0

In [89]:
df

         Algebra  Geometry  Calculus      mean
Name
Alice          3         2         3  2.666667
Bob            4         5         6  5.000000
Claudia        2         3         4  3.000000

In [98]:
df

         Algebra  Geometry  Calculus      mean
Name
Alice          3         2         3  2.666667
Bob            4         5         6  5.000000
Claudia        2         3         4  3.000000

In [99]:
df['mean'] = df.mean(axis=1)

In [101]:
df

         Algebra  Geometry  Calculus      mean
Name
Alice          3         2         3  2.666667
Bob            4         5         6  5.000000
Claudia        2         3         4  3.000000

In [107]:
df['sum'] = df.sum(axis=1)

In [108]:
df

         Algebra  Geometry  Calculus      mean   sum
Name
Alice          3         2         3  2.666667  32.0
Bob            4         5         6  5.000000  60.0
Claudia        2         3         4  3.000000  36.0

In [109]:
df_with_min = df.assign(min=df.min(axis=1))

In [110]:
df_with_min

         Algebra  Geometry  Calculus      mean   sum  min
Name
Alice          3         2         3  2.666667  32.0  2.0
Bob            4         5         6  5.000000  60.0  4.0
Claudia        2         3         4  3.000000  36.0  2.0

In [111]:
df

         Algebra  Geometry  Calculus      mean   sum
Name
Alice          3         2         3  2.666667  32.0
Bob            4         5         6  5.000000  60.0
Claudia        2         3         4  3.000000  36.0

In [112]:
df[df['Algebra'] < 3]

         Algebra  Geometry  Calculus  mean   sum
Name
Claudia        2         3         4   3.0  36.0

In [113]:
df['Algebra'] < 3

Name
Alice      False
Bob        False
Claudia     True
Name: Algebra, dtype: bool

In [117]:
df.assign(min=df.min(axis=1))[lambda x: x['Algebra'] < 4]

         Algebra  Geometry  Calculus      mean   sum  min
Name
Alice          3         2         3  2.666667  32.0  2.0
Claudia        2         3         4  3.000000  36.0  2.0

In [118]:
df.assign(min=df.min(axis=1))[lambda x: (x['Algebra'] < 4) & 
                                        (x['Calculus'] < 4)]

       Algebra  Geometry  Calculus      mean   sum  min
Name
Alice        3         2         3  2.666667  32.0  2.0

In [119]:
df.assign(min=df.min(axis=1)).query('Algebra < 4 and Calculus < 4')

       Algebra  Geometry  Calculus      mean   sum  min
Name
Alice        3         2         3  2.666667  32.0  2.0

In [121]:
df = pd.read_csv("https://github.com/anishshah23/IMDb-5000-Data-analysis/raw/refs/heads/master/movie_metadata.csv")

In [123]:
df.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
movie_title                   object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
dtype: object

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5043 entries, 0 to 5042
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      5024 non-null   object
 1   director_name              4939 non-null   object
 2   num_critic_for_reviews     4993 non-null   float64
 3   duration                   5028 non-null   float64
 4   director_facebook_likes    4939 non-null   float64
 5   actor_3_facebook_likes     5020 non-null   float64
 6   actor_2_name               5030 non-null   object
 7   actor_1_facebook_likes     5036 non-null   float64
 8   gross                      4159 non-null   float64
 9   genres                     5043 non-null   object
 10  actor_1_name               5036 non-null   object
 11  movie_title                5043 non-null   object
 12  num_voted_users            5043 non-null   int64
 13  cast_total_facebook_likes  5043 non-null   int64
 14  actor_3_name               5020 non-null   object
 15  facenumber_in_poster       5030 non-null   float64
 16  plot_keywords              4890 non-null   object
 17  movie_imdb_link            5043 non-null   object
 18  num_user_for_reviews       5022 non-null   float64
 19  language                   5029 non-null   object
 20  country                    5038 non-null   object
 21  content_rating             4740 non-null   object
 22  budget                     4551 non-null   float64
 23  title_year                 4935 non-null   float64
 24  actor_2_facebook_likes     5030 non-null   float64
 25  imdb_score                 5043 non-null   float64
 26  aspect_ratio               4714 non-null   float64
 27  movie_facebook_likes       5043 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [125]:
df

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [135]:
df['color'].value_counts(dropna=False)

color
Color               4815
 Black and White     209
NaN                   19
Name: count, dtype: int64

In [134]:
print(df['color'].value_counts(dropna=False))

color
Color               4815
 Black and White     209
NaN                   19
Name: count, dtype: int64

In [129]:
df.query('color == "Black and White"')

Empty DataFrame
Columns: [color, director_name, num_critic_for_reviews, duration, director_facebook_likes, actor_3_facebook_likes, actor_2_name, actor_1_facebook_likes, gross, genres, actor_1_name, movie_title, num_voted_users, cast_total_facebook_likes, actor_3_name, facenumber_in_poster, plot_keywords, movie_imdb_link, num_user_for_reviews, language, country, content_rating, budget, title_year, actor_2_facebook_likes, imdb_score, aspect_ratio, movie_facebook_likes]
Index: []

[0 rows x 28 columns]

In [136]:
df[df['color'] == ' Black and White']

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
111,Black and White,Michael Bay,191.0,184.0,0.0,691.0,Jaime King,3000.0,198539855.0,Action|Drama|History|Romance|War,...,1999.0,English,USA,PG-13,140000000.0,2001.0,961.0,6.1,2.35,0
149,Black and White,Lee Tamahori,264.0,133.0,93.0,746.0,Colin Salmon,769.0,160201106.0,Action|Adventure|Thriller,...,1185.0,English,UK,PG-13,142000000.0,2002.0,766.0,6.1,2.35,0
257,Black and White,Martin Scorsese,267.0,170.0,17000.0,827.0,Adam Scott,29000.0,102608827.0,Biography|Drama,...,799.0,English,USA,PG-13,110000000.0,2004.0,3000.0,7.5,2.35,0
272,Black and White,Michael Mann,174.0,165.0,0.0,780.0,Jada Pinkett Smith,10000.0,58183966.0,Biography|Drama|Sport,...,386.0,English,USA,R,107000000.0,2001.0,851.0,6.8,2.35,0
286,Black and White,Martin Campbell,400.0,144.0,258.0,834.0,Tobias Menzies,6000.0,167007184.0,Action|Adventure|Thriller,...,2301.0,English,UK,PG-13,150000000.0,2006.0,1000.0,8.0,2.35,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5005,Black and White,Andrew Bujalski,52.0,109.0,26.0,3.0,Kate Dollenmayer,26.0,NaN,Comedy,...,23.0,English,USA,R,NaN,2005.0,6.0,6.9,1.66,91
5008,Black and White,Kevin Smith,136.0,102.0,0.0,216.0,Brian O'Halloran,898.0,3151130.0,Comedy,...,615.0,English,USA,R,230000.0,1994.0,657.0,7.8,1.37,0
5015,Black and White,Richard Linklater,61.0,100.0,0.0,0.0,Richard Linklater,5.0,1227508.0,Comedy|Drama,...,80.0,English,USA,R,23000.0,1991.0,0.0,7.1,1.37,2000
5022,Black and White,Jim Chuchu,6.0,60.0,0.0,4.0,Olwenya Maina,147.0,NaN,Drama,...,1.0,Swahili,Kenya,NaN,15000.0,2014.0,19.0,7.4,NaN,45
5028,Black and White,Ivan Kavanagh,12.0,83.0,18.0,0.0,Michael Parle,10.0,NaN,Horror,...,1.0,English,Ireland,NaN,10000.0,2007.0,5.0,6.7,1.33,105

In [141]:
print(df['color'].str.strip().value_counts())

color
Color              4815
Black and White     209
Name: count, dtype: int64

In [142]:
df['color'] = df['color'].str.strip()

In [144]:
print(df['color'].value_counts())

color
Color              4815
Black and White     209
Name: count, dtype: int64

In [150]:
df = pd.read_csv("https://github.com/anishshah23/IMDb-5000-Data-analysis/raw/refs/heads/master/movie_metadata.csv")
string_columns = df.select_dtypes(include='object').columns
for column in string_columns:
    df[column] = df[column].str.strip()

In [152]:
df.query('color == "Color"')['duration'].mean()

107.04290772755675

In [153]:
df.query('color == "Black and White"')['duration'].mean()

112.2535885167464

In [158]:
df.groupby('color', dropna=False)['duration'].mean()

color
Black and White    112.253589
Color              107.042908
NaN                 90.722222
Name: duration, dtype: float64

In [160]:
np.array([3, 4, np.nan, 2]).mean()

nan

In [165]:
np.nanmean(np.array([3, 4, np.nan, 2]))

3.0

In [161]:
pd.Series([3, 4, np.nan, 2]).mean()

3.0

In [167]:
pd.Series([3, 4, np.nan, 2]).fillna(0).mean()

2.25

In [171]:
df['director_name'].value_counts()['Tim Burton']

16

In [173]:
df.query('director_name == "Tim Burton"').shape

(16, 28)

In [178]:
df['director_name'].value_counts().sort_values(ascending=False)

director_name
Steven Spielberg    26
Woody Allen         22
Clint Eastwood      20
Martin Scorsese     20
Ridley Scott        17
                    ..
Ryan Smith           1
Travis Romero        1
Andrew Haigh         1
Cary Bell            1
Daniel Hsia          1
Name: count, Length: 2398, dtype: int64

In [180]:
df['director_name'].value_counts().sort_index()

director_name
A. Raven Cruz         1
Aaron Hann            1
Aaron Schneider       1
Aaron Seltzer         1
Abel Ferrara          1
                     ..
Zoran Lisinac         1
Álex de la Iglesia    1
Émile Gaudreault      1
Éric Tessier          1
Étienne Faure         1
Name: count, Length: 2398, dtype: int64

In [189]:
df['director_name'].str.split(expand=True)

                0          1     2     3
0           James    Cameron  None  None
1            Gore  Verbinski  None  None
2             Sam     Mendes  None  None
3     Christopher      Nolan  None  None
4            Doug     Walker  None  None
...           ...        ...   ...   ...
5038        Scott      Smith  None  None
5039          NaN        NaN   NaN   NaN
5040     Benjamin    Roberds  None  None
5041       Daniel       Hsia  None  None
5042          Jon       Gunn  None  None

[5043 rows x 4 columns]

In [208]:
df_director_counts = df['director_name'].value_counts().to_frame().reset_index()
df_director_counts = pd.concat([df_director_counts,
    df_director_counts['director_name'].str.split(expand=True).iloc[:, 1]],
                               axis=1).rename(columns={1: 'director_last_name'}).sort_values('director_last_name')

In [209]:
df_director_counts

              director_name  count director_last_name
1239      John 'Bud' Cardos      1              'Bud'
1727         Brian A Miller      1                  A
1790      William A. Fraker      1                 A.
42         George A. Romero      9                 A.
1282  Marius A. Markevicius      1                 A.
...                     ...    ...                ...
1374              Valentine      1               None
1469                   Remo      1               None
1868                  Pitof      1               None
2089                Maïwenn      1               None
2276                    RZA      1               None

[2398 rows x 3 columns]

In [202]:
df_director_counts['director_name'].str.split(expand=True).iloc[:, 1]

0       Spielberg
1           Allen
2        Eastwood
3        Scorsese
4           Scott
          ...
2393          NaN
2394          NaN
2395          NaN
2396          NaN
2397          NaN
Name: 1, Length: 4796, dtype: object

In [201]:
df_director_counts

         director_name  count        1
0     Steven Spielberg   26.0      NaN
1          Woody Allen   22.0      NaN
2       Clint Eastwood   20.0      NaN
3      Martin Scorsese   20.0      NaN
4         Ridley Scott   17.0      NaN
...                ...    ...      ...
2393               NaN    NaN  Crowley
2394               NaN    NaN   Pritts
2395               NaN    NaN       S.
2396               NaN    NaN   Cutler
2397               NaN    NaN     Hsia

[4796 rows x 3 columns]

In [214]:
df.groupby('country')['imdb_score'].mean().sort_values(ascending=False)

country
Kyrgyzstan              8.7
Libya                   8.4
United Arab Emirates    8.2
Egypt                   8.1
Soviet Union            8.1
                       ...
Georgia                 5.6
Peru                    5.4
Aruba                   4.8
Bahamas                 4.4
New Line                4.4
Name: imdb_score, Length: 65, dtype: float64

In [218]:
(df.groupby('country')['imdb_score']
 .agg(['mean', 'count'])
 .sort_values('mean', ascending=False)
 .query('count > 20'))

               mean  count
country
Japan      6.952174     23
Italy      6.873913     23
Spain      6.824242     33
UK         6.818304    448
France     6.678571    154
China      6.623333     30
India      6.532353     34
Australia  6.514545     55
USA        6.367428   3807
Germany    6.340206     97
Canada     6.161905    126

In [220]:
# for each director, find his or her best movie

In [225]:
director_best_scores = df.groupby('director_name')['imdb_score'].max().to_frame().reset_index()

In [228]:
df

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [227]:
director_best_scores

           director_name  imdb_score
0          A. Raven Cruz         1.9
1             Aaron Hann         6.0
2        Aaron Schneider         7.1
3          Aaron Seltzer         2.7
4           Abel Ferrara         6.6
...                  ...         ...
2393       Zoran Lisinac         7.1
2394  Álex de la Iglesia         6.1
2395    Émile Gaudreault         6.7
2396        Éric Tessier         6.6
2397       Étienne Faure         4.3

[2398 rows x 2 columns]

In [231]:
df.columns

Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')

In [240]:
df[['director_name', 'movie_title', 'title_year', 'imdb_score']].merge(director_best_scores.rename(columns={'imdb_score': 'best_imdb_score'}), on='director_name').query('imdb_score == best_imdb_score').sort_values('imdb_score', ascending=False)

,director_name,movie_title,title_year,imdb_score,best_imdb_score
2712,John Blanchard,Towering Inferno,NaN,9.5,9.5
1902,Frank Darabont,The Shawshank Redemption,1994.0,9.3,9.3
3401,Francis Ford Coppola,The Godfather,1972.0,9.2,9.2
4315,John Stockwell,Kickboxer: Vengeance,2016.0,9.1,9.1
66,Christopher Nolan,The Dark Knight,2008.0,9.0,9.0
...,...,...,...,...,...
4669,Georgia Hilton,Subconscious,2015.0,2.2,2.2
3278,Vondie Curtis-Hall,Glitter,2001.0,2.1,2.1
1698,Frédéric Auburtin,United Passions,2014.0,2.0,2.0
4507,A. Raven Cruz,The Helix... Loaded,2005.0,1.9,1.9
1115,Lawrence Kasanoff,Foodfight!,2012.0,1.7,1.7

In [244]:
left = pd.DataFrame({'x': ['a', 'b'], 'y': [1, 2]})
right = pd.DataFrame({'x': ['a', 'w', 'a'], 'u': [1, 2, 3]})

In [247]:
left

   x  y
0  a  1
1  b  2

In [248]:
right

   x  u
0  a  1
1  w  2
2  a  3

In [246]:
left.merge(right, on='x', how='left')

   x  y    u
0  a  1  1.0
1  a  1  3.0
2  b  2  NaN

In [249]:
left.merge(right, on='x', how='right')

   x    y  u
0  a  1.0  1
1  w  NaN  2
2  a  1.0  3

In [250]:
left.merge(right, on='x', how='outer')

   x    y    u
0  a  1.0  1.0
1  a  1.0  3.0
2  b  2.0  NaN
3  w  NaN  2.0

In [252]:
left.merge(right, how='cross')

  x_x  y x_y  u
0   a  1   a  1
1   a  1   w  2
2   a  1   a  3
3   b  2   a  1
4   b  2   w  2
5   b  2   a  3